'use client'
import { create } from "zustand";
type Item = {
  id: number;
  name: string;
};


export const PARACLINIC_ITEMS: Item[] = [
  // آزمایش‌ها
  { id: 1, name: "CBC",  },
  { id: 2, name: "FBS",  },
  { id: 3, name: "HbA1c",  },
  { id: 4, name: "BUN / Cr",  },
  { id: 5, name: "LFT",  },
  { id: 6, name: "Lipid Profile",  },
  { id: 7, name: "CRP",  },
  { id: 8, name: "ESR",  },
  { id: 9, name: "TSH",  },
  { id: 10, name: "UA/UC",  },

  // تصویربرداری
  { id: 11, name: "رادیوگرافی ساده",  },
  { id: 12, name: "سونوگرافی شکم",  },
  { id: 13, name: "سونوگرافی لگن",  },
  { id: 14, name: "CT Scan",  },
  { id: 15, name: "MRI",  },

  // قلب و عروق
  { id: 16, name: "ECG" },
  { id: 17, name: "ECHO" },
  { id: 18, name: "تست ورزش" },

  // سایر
  { id: 19, name: "نوار عصب و عضله (EMG/NCV)",  },
  { id: 20, name: "تست بینایی‌سنجی",  },
];


export const DRUGS: Item[] = [
  { id: 1, name: "استامینوفن ۵۰۰" },
  { id: 2, name: "ایبوپروفن ۴۰۰" },
  { id: 3, name: "ناپروکسن ۲۵۰" },
  { id: 4, name: "دیکلوفناک ۵۰" },
  { id: 5, name: "آسپرین ۸۰" },
  { id: 6, name: "ترامادول ۵۰" },
  { id: 7, name: "کتورولاک ۱۰" },
  { id: 8, name: "متوکاربامول ۵۰۰" },
  { id: 9, name: "باکلوفن ۱۰" },
  { id: 10, name: "تیزانیدین ۴" },

  { id: 11, name: "آموکسی‌سیلین ۵۰۰" },
  { id: 12, name: "آموکسی‌کلاو ۶۲۵" },
  { id: 13, name: "سفالکسین ۵۰۰" },
  { id: 14, name: "سفیکسیم ۴۰۰" },
  { id: 15, name: "سفتریاکسون ۱ گرم" },
  { id: 16, name: "کلاریترومایسین ۵۰۰" },
  { id: 17, name: "آزیترومایسین ۵۰۰" },
  { id: 18, name: "سیپروفلوکساسین ۵۰۰" },
  { id: 19, name: "لووفلوکساسین ۵۰۰" },
  { id: 20, name: "کو-تریموکسازول" },

  { id: 21, name: "متفورمین ۵۰۰" },
  { id: 22, name: "گلی‌بنکلامید ۵" },
  { id: 23, name: "گلیمپیرید ۲" },
  { id: 24, name: "آکاربوز ۵۰" },
  { id: 25, name: "سیتاگلیپتین ۱۰۰" },

  { id: 26, name: "آتنولول ۵۰" },
  { id: 27, name: "متوپرولول ۵۰" },
  { id: 28, name: "پروپرانولول ۴۰" },
  { id: 29, name: "انالاپریل ۱۰" },
  { id: 30, name: "لوزارتان ۵۰" },
  { id: 31, name: "والزارتان ۸۰" },
  { id: 32, name: "آملودیپین ۵" },
  { id: 33, name: "نیفدیپین ۱۰" },
  { id: 34, name: "هیدروکلروتیازید ۲۵" },
  { id: 35, name: "فوروزماید ۴۰" },

  { id: 36, name: "آتورواستاتین ۲۰" },
  { id: 37, name: "روسوواستاتین ۱۰" },
  { id: 38, name: "جمفیبروزیل ۳۰۰" },
  { id: 39, name: "کلُوپیدوگرل ۷۵" },
  { id: 40, name: "وارفارین ۵" },

  { id: 41, name: "امپرازول ۲۰" },
  { id: 42, name: "پنتوپرازول ۴۰" },
  { id: 43, name: "فاموتیدین ۲۰" },
  { id: 44, name: "رانیتیدین ۱۵۰" },
  { id: 45, name: "دامپریدون ۱۰" },
  { id: 46, name: "متوکلوپرامید ۱۰" },

  { id: 47, name: "لورازپام ۱" },
  { id: 48, name: "دیازپام ۵" },
  { id: 49, name: "آلپرازولام ۰.۵" },
  { id: 50, name: "سرترالین ۵۰" },
  { id: 51, name: "فلوکستین ۲۰" },
  { id: 52, name: "ونلافاکسین ۷۵" },

  { id: 53, name: "سالبوتامول اسپری" },
  { id: 54, name: "بودزوناید اسپری" },
  { id: 55, name: "فلوتیکازون اسپری" },
  { id: 56, name: "مونتلوکاست ۱۰" },
  { id: 57, name: "ستیریزین ۱۰" },
  { id: 58, name: "لوراتادین ۱۰" },

  { id: 59, name: "لووتیروکسین ۱۰۰" },
  { id: 60, name: "پردنیزولون ۵" },
  { id: 61, name: "هیدروکورتیزون ۱۰" },
  { id: 62, name: "بتامتازون ۰.۵" },

  { id: 63, name: "فروس سولفات" },
  { id: 64, name: "فولیک اسید ۵" },
  { id: 65, name: "ویتامین D3 1000" },
  { id: 66, name: "کلسیم-دی" },
  { id: 67, name: "منیزیم ۲۵۰" },
  { id: 68, name: "زینک ۵۰" },

  { id: 69, name: "کلوتریمازول کرم" },
  { id: 70, name: "موپیروسین پماد" },
];
type DashboardDoctor = {
  
};
export const useDashboardDoctorStore = create<DashboardDoctor>((set, get) => ({
 
}));
